cache/posts/ssh.html
<div id="outline-container-orgafe7863" class="outline-2">
<h2 id="orgafe7863">SSH 端口转发</h2>
<div class="outline-text-2" id="text-orgafe7863">
</div>
<div id="outline-container-org8a3720a" class="outline-3">
<h3 id="org8a3720a">本地转发: 本地访问远程</h3>
<div class="outline-text-3" id="text-org8a3720a">
<p>
本地转发，顾名思义就是把本地主机端口通过待登录主机端口转发到远程主机端口上去。
</p>

<p>
本地转发通过参数 -L 指定，格式：-L [本地主机:]本地主机端口:远程网络主机:远程网络主机端口。加上ssh待登录主机，这里就有了三台主机。
</p>

<p>
举例：~ssh -L 0.0.0.0:50000:host2:80 user@host1~ 。这条命令将host2的80端口映射到本地的50000端口，前提是待登录主机host1上可以正常连接到host2的80端口。
</p>

<p>
畅想一下这个功能的作用：
</p>
<ol class="org-ol">
<li>因为本地的mysql更顺手，想用本地的mysql客户端命令连接受限网络环境的mysql服务端。</li>
<li>本地安装了开发工具，想用这个开发工具连接受限网络环境中某个服务的远程调试端口。</li>
</ol>
</div>
</div>

<div id="outline-container-org6db3198" class="outline-3">
<h3 id="org6db3198">远程转发: 远程访问本地</h3>
<div class="outline-text-3" id="text-org6db3198">
<p>
远程转发是指把登录主机所在网络中某个端口通过本地主机端口转发到远程主机上。
</p>

<p>
远程转发通过参数 -R 指定，格式：-R [登录主机:]登录主机端口:本地网络主机:本地网络主机端口。
</p>

<p>
举例：~ssh -R 0.0.0.0:8080:host2:80 user@host1~ 。这条命令将host2的80端口映射到待登录主机host1的8080端口，前提是本地主机可以正常连接host2的80端口。
</p>

<p>
畅想一下这个功能的作用：
</p>

<ol class="org-ol">
<li>本地网络中有一个http代理，通过这个代理可以上外网，因此通过这条命令将这个http代理映射到待登录主机的某个端口，这样受限网络环境中所有其它服务器即可使用这个http代理上外网了。</li>
<li>在本机开发了一个web应用，想拿给别人测试，但现在你却处在内网，外网是无法直接访问内网的主机的，怎么办！？很多人可能会说，找台有公网IP的主机，重新部署一下就行了。这样可行，但太麻烦。然而自从你了解了ssh的远程转发之后，一切都变得简单了。只需在本地主机上执行一下上面例子的命令即可实现外网访问内网的web应用。</li>
</ol>

<p>
注意：
</p>
<ol class="org-ol">
<li>sshd<sub>config里要打开AllowTcpForwarding选项</sub>，否则-R远程端口转发会失败。</li>
<li>默认转发到远程主机上的端口绑定的是127.0.0.1，如要绑定0.0.0.0需要打开sshd<sub>config里的GatewayPorts选项</sub>。这个选项如果由于权限没法打开也有办法，可配合ssh -L将端口绑定到0.0.0.0，聪明的你应该能想到办法，呵呵。</li>
</ol>
</div>
</div>

<div id="outline-container-org409963c" class="outline-3">
<h3 id="org409963c">动态转发</h3>
<div class="outline-text-3" id="text-org409963c">
<p>
相对于本地转发和远程转发的单一端口转发模式而言，动态转发有点更加强劲的端口转发功能，即是无需固定指定被访问目标主机的端口号。这个端口号需要在本地通过协议指定，该协议就是简单、安全、实用的 SOCKS 协议。
</p>

<p>
动态转发通过参数 -D 指定，格式：-D [本地主机:]本地主机端口。相对于前两个来说，动态转发无需再指定远程主机及其端口。它们由通过 SOCKS协议 连接到本地主机端口的那个主机。
</p>

<p>
举例：~ssh -D 50000 user@host1~ 。这条命令创建了一个SOCKS代理，所以通过该SOCKS代理发出的数据包将经过host1转发出去。
</p>

<p>
怎么使用？
</p>

<ol class="org-ol">
<li>用firefox浏览器，在浏览器里设置使用socks5代理127.0.0.1:50000，然后浏览器就可以访问host1所在网络内的任何IP了。</li>
<li><p>
如果是普通命令行应用，使用proxychains-ng，参考命令如下：
</p>
<div class="highlight"><pre><span></span>      brew install proxychains-ng
      vim /usr/local/etc/proxychains.conf # 在ProxyList配置段下添加配置 &quot;socks5 	127.0.0.1 50000&quot;
      proxychains-ng wget http://host2 # 在其它命令行前添加proxychains-ng即可
</pre></div></li>
<li><p>
如果是ssh，则用以下命令使用socks5代理：
</p>
<div class="highlight"><pre><span></span>      ssh -o ProxyCommand=&#39;/usr/bin/nc -X 5 -x 127.0.0.1:5000 %h %p&#39; user@host2
</pre></div></li>
</ol>

<p>
畅想一下这个功能的作用：
</p>
<ol class="org-ol">
<li>想访问受限网络环境中的多种服务</li>
<li>FQ</li>
<li>……</li>
</ol>
</div>
</div>
</div>


<div id="outline-container-org62f0719" class="outline-2">
<h2 id="org62f0719">免密码登录</h2>
<div class="outline-text-2" id="text-org62f0719">
</div>
<div id="outline-container-org6c7a4d4" class="outline-3">
<h3 id="org6c7a4d4">在本地机器生成密钥对</h3>
<div class="outline-text-3" id="text-org6c7a4d4">
<div class="highlight"><pre><span></span>   ssh-keygen -t rsa
</pre></div>
<p>
根据提示设置文件名和密码
</p>
</div>
</div>

<div id="outline-container-orge364648" class="outline-3">
<h3 id="orge364648">授权登录</h3>
<div class="outline-text-3" id="text-orge364648">
<p>
将公钥追加到目标服务器的 <code>$HOME/.ssh/authorized_keys</code> 文件中，该文件的权限应为 <code>600</code> ， <code>.ssh</code> 目录权限应为 <code>700</code>
</p>
<div class="highlight"><pre><span></span>   touch ~/.ssh/authorized_keys
   chmod 600 ~/.ssh/authorized_keys
   cat ~/.ssh/a_rsa.pub &gt;&gt; ~/.ssh/authorized_keys
</pre></div>

<p>
测试一下
</p>
<div class="highlight"><pre><span></span>   ssh username@localhost
</pre></div>
</div>
</div>
</div>

<div id="outline-container-org8b39acc" class="outline-2">
<h2 id="org8b39acc">配置别名</h2>
<div class="outline-text-2" id="text-org8b39acc">
<p>
在 <code>~/.ssh/config</code> 中配置别名，就不用记 ip 了。
</p>

<div class="highlight"><pre><span></span>  # 指定使用 bash 登录
  Host thbash
      HostName 10.0.0.101
      User username
      RequestTTY yes
      RemoteCommand bash

  # 指定使用 zsh 登录
  Host th
      HostName 10.0.0.101
      User username
      RequestTTY yes
      RemoteCommand zsh

  # 最基本的设置
  Host group1
      Hostname 10.0.5.90
      User username
</pre></div>
</div>
</div>
